package extraHomework_2;


import java.util.Arrays;

public class HomeworkMainTicTacToe {
   /* Необходимо написать консольную игру «Крестики-нолики».
    Игра должна реализовываться на поле размером 3×3. На начальном этапе все ячейки игрового поля должны быть заполнены
    любым значением, которое не соответствует символам «X» или «0», чтобы было понятно, что клетка свободна.

    Перед началом игры с помощью класса Random необходимо случайным образом определить, кто будет ходить первым:
    пользователь или искусственный интеллект. Игрок, который ходит первым, ставит крестики «X», а второй игрок ставит
        нолики «0».

    Пользователь играет против искусственного интеллекта. Ход пользователя должен осуществляться через консольный ввод
    координат ячейки. Координаты должны вводиться в формате строки и столбца, например: 1 0 или 1,0. После ввода
    координат программа должна проверять, существует ли такая ячейка на поле и свободна ли она. Если координаты введены
    неверно или ячейка уже занята, программа должна вывести сообщение об ошибке и предложить пользователю повторить ввод.

    Искусственный интеллект должен делать ход автоматически. Минимальная реализация может предусматривать случайный
    выбор свободной клетки. После каждого хода игровое поле должно выводиться в консоль в актуальном состоянии.

    Программа должна проверять условия победы после каждого хода. Победа засчитывается, если один из игроков заполнил
    своими символами одну строку, один столбец или одну диагональ. Если все клетки заполнены, но победитель не
    определён, игра завершается ничьей.

    После завершения игры программа должна вывести итоговое сообщение: победил пользователь, победил искусственный
    интеллект или игра завершилась вничью.

    Программа должна спросить пользователя - желает ли он повторить игру, если да, игра начинается заново, если нет,
    конец программы.

    */
   public static void main(String[] args) {
       System.out.println("Extra homework 2");
       System.out.println("Task 1 - Tic-Tac-Toe: ");

       TicTacToe board = new TicTacToe ();
       System.out.println("-".repeat(90));
       System.out.println(Arrays.deepToString(board.getBoard()));

       board.pleaGame();

   }

//    public static void createTicTacToe() {
//
//        char [][] arrayBoard = new char[3][3];
//        System.out.println(Arrays.deepToString(arrayBoard));
//        TicTacToe board = new TicTacToe (arrayBoard);
//
//        System.out.println("Создан массив размера доски TicTacToeBoard");
//        board.createTicTacToeBoard();
//        System.out.println("Объект  board игры  создан в методе");
//    }



}
