package homework_7;

public class HomeworkMainHospital {
   /* Задача 1:
    Создать программу для имитации работы клиники. Пусть в клинике будет три врача:
    хирург, терапевт и дантист. Каждый врач имеет метод «лечить», но каждый врач лечит
    по-своему. Так же предусмотреть класс «Пациент» с полем «План лечения» и полем
    «Доктор». Создать объект класса «Пациент» и добавить пациенту план лечения. У
    терапевта создать метод, который будет назначать врача пациенту согласно плану
    лечения:
    Если план лечения имеет код 1 – назначить хирурга и выполнить метод лечить.
    Если план лечения имеет код 2 – назначить дантиста и выполнить метод лечить.
    Если план лечения имеет любой другой код – назначить терапевта и выполнить метод
    лечить.
            Задача *:

    Создать класс Apple и добавить в него поле color с модификатором доступа private и
    инициализировать его. В методе main другого класса создать объект Apple, и не
    используя сеттеры изменить значение поля color.
    */

    public static void main (String[] args){
        System.out.println("Homework 7 ");
        System.out.println("Task 1 : ");
        createHospital();
        System.out.println("-".repeat(90));
    }

    public static void createHospital(){

        Patient patient = new Patient(1);
        PCP therapist = new PCP();
        therapist.assignDoctor(patient);

    }


}
