package extraHomework_1;

import java.util.Arrays;
import java.util.Scanner;

public class HomeworkMainGuessTheWord {
    /* Техническое задание №1. Игра «Угадай слово»
     Необходимо разработать консольную игру «Угадай слово».
             1. Исходные данные
 1. Создать массив строк, содержащий 20 различных слов. Слова выбираются студентом самостоятельно.
             2. С помощью генератора случайных чисел выбрать одно слово из массива и сохранить его как загаданное.
 2. Правила игры
     Пользователь должен угадать загаданное слово. Возможны два варианта ввода:
 - ввод всего слова целиком;
 - ввод одной буквы.
     3. Логика работы программы
 1. Пользователь получает 5 попыток.
 2. Если пользователь вводит слово полностью и оно совпадает с загаданным, игра завершается сообщением о победе.
 3. Если пользователь вводит одну букву:
 - при правильном ответе буква открывается во всех соответствующих позициях слова;
 - при неправильном ответе количество оставшихся попыток уменьшается на единицу, после чего программа запрашивает новый ввод.
   4. Игра продолжается до тех пор, пока:
  - пользователь не угадает всё слово;
  - либо не будут исчерпаны все 5 попыток.
 4. Условия завершения игры
             Победа
   Пользователь считается победителем, если:
 - угадал слово целиком с первой или последующих попыток;
 - либо последовательно открыл все буквы слова до исчерпания пяти попыток.
  Поражение
  Если все 5 попыток использованы, а слово не угадано, программа должна вывести сообщение о поражении.
  5. Повторный запуск
     После проигрыша программа должна вывести вопрос:
             «Хотите начать заново?»
     Возможны два варианта ответа:
   «Да» — игра начинается сначала, при этом снова случайным образом выбирается слово из массива.
 - «Нет» — программа завершает работу и выводит сообщение:
  «Прощайте, до свидания».
             6. Дополнительные требования
 1. Игра должна быть реализована в консольном режиме.
 2. Использовать массив из 20 различных слов.
 3. Для выбора загаданного слова использовать генератор случайных чисел.
 4. Количество попыток должно храниться в отдельной переменной.
 5. Программа должна корректно обрабатывать ввод пользователя и обеспечивать возможность повторного запуска игры.

     */
    public static void main(String[] args) {
        System.out.println("Extra homework 1");
        System.out.println("Task 1 - Guess the word: ");
        createGuessTheWord();
        System.out.println("-".repeat(90));
    }

    public static void createGuessTheWord() {
        Scanner scanner = new Scanner(System.in);
        boolean play = true;
        while (play) {
            play = false;
            GuessTheWord game = new GuessTheWord();
            game.createOriginalWords();
            game.makeSecretWord();
            game.askQuestion();
            game.makeArreyOfSecretWord();
            game.hideArreyGetters();

            System.out.println(Arrays.toString(game.getMockWord()));


            for (int i = 0; i < 5; i++) {
                String wordFromScanner = scanner.next();
                boolean win = game.insertLetterOfWord(wordFromScanner);
                if (win) {
                    System.out.println("Выйграл");
                    System.out.println("Слово " + game.getSecretWord());
                    break;
                }
                System.out.println(Arrays.toString(game.getMockWord()));
            }
            System.out.println("Сыграть еще ? Y/N");
            String design = scanner.next();
            if (design.equals("Y")) {
                play = true;
            }
        }
        scanner.close();
    }
}
